// Задача №22. Работа в группах
// Напишите программу, которая принимает на вход 
// число (N) и выдаёт таблицу квадратов чисел 
// от 1 до N.
// ● 5 -> 1, 4, 9, 16, 25.
// ● 2 -> 1,4

// Console.Clear();
// int number = ReadInt("Введите число: ");

// for (int i = 1; i <= number; i++)
// {
//     Console.Write($"{i * i}, ");
// }

// // Метод
// int ReadInt(string message)
// {
//     Console.Write(message);
//     return Convert.ToInt32(Console.ReadLine());
// }

